; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v8 - type_2 ?v3 - type_3)
 	      (pred_2 ?v5 - object ?v3 - type_3)
	      (pred_1 ?v8 - type_2 ?v2 - type_1)
	      (pred_3 ?v8 - type_2 ?v5 - object ?v2 - type_1))

   (:action op_3
       :parameters  (?v8 - type_2 ?v4 ?v7 - type_3)
       :precondition (and  (pred_4 ?v8 ?v4))
       :effect (and  (pred_4 ?v8 ?v7)
		     (not (pred_4 ?v8 ?v4))))

   (:action op_2
       :parameters (?v8 - type_2 ?v6 - object ?v1 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v1) (pred_4 ?v8 ?v1) (pred_1 ?v8 ?v2))
       :effect (and (pred_3 ?v8 ?v6 ?v2)
		    (not (pred_2 ?v6 ?v1)) 
		    (not (pred_1 ?v8 ?v2))))

   (:action op_1
       :parameters (?v8 - type_2 ?v6 - object ?v1 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v6 ?v2) (pred_4 ?v8 ?v1))
       :effect (and (pred_2 ?v6 ?v1)
		    (pred_1 ?v8 ?v2)
		    (not (pred_3 ?v8 ?v6 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_13 obj_01 - type_2
obj_10 obj_11 obj_08 obj_12 - type_1
obj_04 obj_03 obj_07 obj_09 - type_3
obj_05 obj_02 obj_06 obj_14 - object)
(:init
(pred_4 obj_13 obj_09)
(pred_1 obj_13 obj_10)
(pred_1 obj_13 obj_11)
(pred_4 obj_01 obj_04)
(pred_1 obj_01 obj_08)
(pred_1 obj_01 obj_12)
(pred_2 obj_05 obj_09)
(pred_2 obj_02 obj_04)
(pred_2 obj_06 obj_09)
(pred_2 obj_14 obj_07)
)
(:goal
(and
(pred_2 obj_05 obj_04)
(pred_2 obj_02 obj_09)
(pred_2 obj_06 obj_03)
(pred_2 obj_14 obj_07)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_13 obj_09) (pred_4 obj_01 obj_09))))
  )
)
)

; plan
1. (op_2 obj_01 obj_02 obj_04 obj_12)
   deleted: (pred_2 obj_02 obj_04) (pred_1 obj_01 obj_12)
   added: (pred_3 obj_01 obj_02 obj_12)
   goals met: 1 of 4
2. (op_2 obj_13 obj_06 obj_09 obj_11)
   deleted: (pred_2 obj_06 obj_09) (pred_1 obj_13 obj_11)
   added: (pred_3 obj_13 obj_06 obj_11)
   goals met: 1 of 4
3. (op_2 obj_13 obj_05 obj_09 obj_10)
   deleted: (pred_2 obj_05 obj_09) (pred_1 obj_13 obj_10)
   added: (pred_3 obj_13 obj_05 obj_10)
   goals met: 1 of 4
4. (op_3 obj_13 obj_09 obj_03)
   deleted: (pred_4 obj_13 obj_09)
   added: (pred_4 obj_13 obj_03)
   goals met: 1 of 4
5. (op_3 obj_01 obj_04 obj_09)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_09)
   goals met: 1 of 4
6. (op_1 obj_01 obj_02 obj_09 obj_12)
   deleted: (pred_3 obj_01 obj_02 obj_12)
   added: (pred_2 obj_02 obj_09) (pred_1 obj_01 obj_12)
   goals met: 2 of 4
7. (op_1 obj_13 obj_06 obj_03 obj_11)
   deleted: (pred_3 obj_13 obj_06 obj_11)
   added: (pred_2 obj_06 obj_03) (pred_1 obj_13 obj_11)
   goals met: 3 of 4
8. (op_3 obj_13 obj_03 obj_04)
   deleted: (pred_4 obj_13 obj_03)
   added: (pred_4 obj_13 obj_04)
   goals met: 3 of 4
9. (op_1 obj_13 obj_05 obj_04 obj_10)
   deleted: (pred_3 obj_13 obj_05 obj_10)
   added: (pred_2 obj_05 obj_04) (pred_1 obj_13 obj_10)
   goals met: 4 of 4
